================================================================================
Bitstring empty
================================================================================

<<>>

--------------------------------------------------------------------------------

(source_file (binary_string))

================================================================================
Bitstring with integer
================================================================================

<<10>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number))))

================================================================================
Bitstring with integer and type-specifier
================================================================================

<<10 :: integer>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)))))

================================================================================
Bitstring with integer and multiple type-specifier
================================================================================

<<10 :: integer-signed-native>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)
        (bin_type)
        (bin_type)))))

================================================================================
Bitstring with integer and bit-pattern size
================================================================================

<<10 :: 2>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)))))

================================================================================
Bitstring with integer and bit-pattern size and type-specifier
================================================================================

<<10 :: 2-little>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)
        (bin_type)))))

================================================================================
Bitstring with integer and bit-pattern size and multiple type-specifiers
================================================================================

<<10 :: 2-little-unsigned>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)
        (bin_type)
        (bin_type)))))

================================================================================
Bitstring with float
================================================================================

<<10.10>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
        (bin_part
          (number))))

================================================================================
Bitstring with float and type-specifier
================================================================================

<<10.10 :: float>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)))))

================================================================================
Bitstring with float and multiple type-specifier
================================================================================

<<10.10 :: float-signed-native>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)
        (bin_type)
        (bin_type)))))

================================================================================
Bitstring with float and bit-pattern size
================================================================================

<<10.10 :: 32>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)))))

================================================================================
Bitstring with float and bit-pattern size and type-specifier
================================================================================

<<10.10 :: 32-little>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)
        (bin_type)))))

================================================================================
Bitstring with float and bit-pattern size and multiple type-specifiers
================================================================================

<<10.10 :: 32-little-unsigned>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)
        (bin_type)
        (bin_type)))))

================================================================================
Bitstring with string
================================================================================

<<"10">>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (string))))

================================================================================
Bitstring with many components
================================================================================

<<10 :: 8-native, "hello", 10.2 :: unsigned, a :: 8, b :: binary>>

--------------------------------------------------------------------------------

(source_file
  (binary_string
    (bin_part
      (number)
      (bin_type_list
        (bin_type)
        (bin_type)))
    (bin_part
      (string))
    (bin_part
      (number)
      (bin_type_list
        (bin_type)))
    (bin_part
      (variable)
      (bin_type_list
        (bin_type)))
    (bin_part
      (variable)
      (bin_type_list
        (bin_type)))))
